<?xml version="1.0" ?>
<net batch="1" name="speech_recognition_frozen_graph" version="3">
	<layers>
		<layer id="0" name="Reshape_1/placeholder_port_0" precision="FP16" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>98</dim>
					<dim>40</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Reshape_1" precision="FP16" type="Reshape">
			<data axis="0" dim="-1,1,98,40" num_axes="-1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>98</dim>
					<dim>40</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>98</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="20,8" output="64" pads_begin="9,3" pads_end="10,4" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>98</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>98</dim>
					<dim>40</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="20480"/>
				<biases offset="20480" size="128"/>
			</blobs>
		</layer>
		<layer id="3" name="Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>98</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>98</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="MaxPool" precision="FP16" type="Pooling">
			<data auto_pad="same_upper" exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>98</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>49</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Conv2D_1" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="10,4" output="64" pads_begin="4,1" pads_end="5,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>49</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>49</dim>
					<dim>20</dim>
				</port>
			</output>
			<blobs>
				<weights offset="20608" size="327680"/>
				<biases offset="348288" size="128"/>
			</blobs>
		</layer>
		<layer id="6" name="Relu_1" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>49</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>49</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Reshape_2" precision="FP16" type="Reshape">
			<data axis="0" dim="-1,62720" num_axes="-1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>49</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>62720</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="MatMul" precision="FP16" type="FullyConnected">
			<data out-size="12"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>62720</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>12</dim>
				</port>
			</output>
			<blobs>
				<weights offset="348416" size="1505280"/>
				<biases offset="1853696" size="24"/>
			</blobs>
		</layer>
		<layer id="9" name="labels_softmax" precision="FP16" type="SoftMax">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="1" to-port="0"/>
		<edge from-layer="1" from-port="1" to-layer="2" to-port="0"/>
		<edge from-layer="2" from-port="3" to-layer="3" to-port="0"/>
		<edge from-layer="3" from-port="1" to-layer="4" to-port="0"/>
		<edge from-layer="4" from-port="1" to-layer="5" to-port="0"/>
		<edge from-layer="5" from-port="3" to-layer="6" to-port="0"/>
		<edge from-layer="6" from-port="1" to-layer="7" to-port="0"/>
		<edge from-layer="7" from-port="1" to-layer="8" to-port="0"/>
		<edge from-layer="8" from-port="3" to-layer="9" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="1.4.292.6ef7232d"/>
		<cli_parameters>
			<data_type value="FP16"/>
			<disable_fusing value="False"/>
			<disable_gfusing value="False"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_resnet_optimization value="False"/>
			<extensions value="DIR"/>
			<framework value="tf"/>
			<generate_deprecated_IR_V2 value="False"/>
			<input value="0:Reshape_1"/>
			<input_model value="DIR/speech_recognition_frozen_graph.pb"/>
			<input_model_is_text value="False"/>
			<input_shape value="[1,40,1,98]"/>
			<log_level value="ERROR"/>
			<mean_values value="()"/>
			<move_to_preprocess value="False"/>
			<offload_unsupported_operations_to_tf value="False"/>
			<output_dir value="DIR"/>
			<reverse_input_channels value="False"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<version value="False"/>
			<unset unset_cli_parameters="batch, finegrain_fusing, freeze_placeholder_with_value, input_checkpoint, input_meta_graph, model_name, output, saved_model_dir, saved_model_tags, scale, tensorboard_logdir, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_object_detection_api_pipeline_config, tensorflow_operation_patterns, tensorflow_subgraph_patterns, tensorflow_use_custom_operations_config"/>
		</cli_parameters>
	</meta_data>
</net>
